In [2]:
import numpy as np 
import pandas as pd

movie = pd.read_csv('movies_title.csv')
movie.head()

                     title  year
0           The Rising Son  1990
1        Ashes of Kukulcan  2016
2  The Thousand Plane Raid  1969
3         Crucea de piatra  1993
4                   The 86  2015


  - 1. 데이터셋  영화 타이틀 데이터 셋. 
      -. moves_title.csv 
  - 2. titles의 Data Frame을 만든다. 
  - 3. df 필수 명령 8가지 실행 
  - 4. 전체 영화는 몇개인가? 
  - 5. 가장 빠른 시기에 제작된 영화 2개를 찾아라. 
  - 6. 제목이 "Hamlet"인 영화는 몇개인가? 
  - 7. 제목이 "Treasure Island"는 몇개인가? 제작년도 오름차순으로 나열
  - 8. 1950년에서 1959년사이에 만들어진 영화는 몇개인가?

In [ ]:
#1

In [ ]:
#2

In [ ]:
#3
movie.head()
movie.tail()
movie.describe()
movie.info()
movie.loc[5,'title']
movie.isnull().sum()
movie['title'].value_counts()
movie.columns
#set_index(),index, columns, value_counts(), astype

In [33]:
#4
movie.shape[0]

215981

In [47]:
#5
movie.sort_values('year').head(2)

                                                    title  year
165182                                         Miss Jerry  1894
85708   Reproduction of the Corbett and Fitzsimmons Fight  1897

In [32]:
#6
movie[movie['title'].str.contains('Hamlet')].shape[0]

54

In [30]:
#7
movie[movie['title'].str.contains('Treasure Island')].sort_values('year')

                                                    title  year
191379                                    Treasure Island  1918
47769                                     Treasure Island  1920
192917                                    Treasure Island  1934
134298                      The Secret of Treasure Island  1938
55661                     Charlie Chan at Treasure Island  1939
90175                                     Treasure Island  1950
174084                          Return to Treasure Island  1954
153356                          Five on a Treasure Island  1957
104714                                    Treasure Island  1972
103646                                    Treasure Island  1973
190792                                    Treasure Island  1985
121716                             Muppet Treasure Island  1996
95292                                Treasure Island (II)  1999
166675                                    Treasure Island  1999
26182                          Pirates of Treasure Island  2006
167715  Treasure Island Kids: The Mystery of Treasure ...  2006
185460  Treasure Island Kids: The Battle of Treasure I...  2006
207832  Treasure Island Kids: The Monster of Treasure ...  2006
178074             National Theatre Live: Treasure Island  2015

In [31]:
#8
movie[(movie['year']>=1950) & (movie['year']<=1959)].shape[0]

12120